[Category name] Color Fill Legend can only be placed in a Floor Plan View.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SymtemColorFillLegendNotAllowed { get; }
  Visual Basic
Public Shared ReadOnly Property SymtemColorFillLegendNotAllowed As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SymtemColorFillLegendNotAllowed {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ColorFillFailures Class
  Autodesk.Revit.DB Namespace